---
kind: property
id: P:Autodesk.Revit.DB.Control.Shape
source: html/8ebc1565-cc03-a7e4-0e0e-2bf0095cc399.htm
---
# Autodesk.Revit.DB.Control.Shape Property

The control shape.

## Syntax (C#)
```csharp
public ControlShape Shape { get; }
```